{
  "date": "{{val, datetime}}",
  "0": "Construit un prototype d'application mobile.",
  "1": "Rédigé de la documentation pour aider le reste de l'équipe à configurer le débogage étape par étape avec Xdebug sur VSCode + Docker. Cette tâche est complexe car elle implique la publication des fichiers Docker et nécessite plusieurs configurations pour s'assurer que tout fonctionne correctement.",
  "2": "Corrigé un problème où les utilisateurs étaient en mesure de mettre la base de données dans un état qui aurait dû être impossible. Après avoir examiné le problème, nous avons découvert que les utilisateurs pouvaient exploiter le fait que s'ils enregistraient l'URL de la page de confirmation que nous montrons à la fin d'un flux spécifique et la chargeaient avant la fin du flux, cela soumettait prématurément la demande de \"réalisation\" et mettait la base de données dans l'état défectueux. Nous avons ajouté des vérifications supplémentaires pour éviter que cela ne se produise.",
  "3": "As a result of their partnership with North P&D, Minebright is able to obtain, without prior notice nor any minimum commitment, help with quality assurance from one of our team members in support of their software development team.",
  "4": "We are currently assisting Tension in constructing a high-quality digital product in accordance with their design specifications.",
  "5": "Built a CI/CD pipeline which periodically backs up the project's git repo to AWS S3, always maintaining the latest two backup versions in an S3 bucket. Leveraged AWS IAM to ensure only minimal security permissions were granted to the GitHub Actions runner.",
  "6": "Implemented one-time password phone login functionality using the Twilio API. This enables users to immediately log in to their account using their mobile phone if they forget their password.",
  "7": "Built a system which reads email template blade files from the codebase and renders them dynamically with user-chosen database records, allowing the admin team to preview emails being sent to specific customers under specific circumstances. In order to maximize maintainability and code-conciseness, we used PHP's built-in iterators to read the files while only specifying their parent folder's name.",
  "8": "As the client's project evolved, they decided to spin off a new project in the same industry as their main product. The new project had a different frontend, but shared a lot of its backend with the client's main product. In support of this endeavour, we took full ownership of the design and implementation of a system allowing to differentiate various backend objects (such as users, orders or emails) by their parent project, and to automatically take different actions based on the object's parent project. Among the various actions, we buit support for sending emails from a different email address and domain depending on the parent project. This was technically challenging because it involves updating Laravel's <code>MailgunTransport</code>'s configuration at runtime, which requires creating a new instance of <code>MailgunTransport</code> and binding it into the service container. To build this, we made heavy use of Laravel's Tinker tool to efficiently iterate on our code and test it.",
  "9": "Leveraged the Mailgun and Mailchimp APIs to allow admins to manage users' subscription status to the client's two newsletters.",
  "10": "Implemented a system to manage failed Laravel queued jobs, allowing our client to easily monitor and retry failed jobs.",
  "11": "Implemented a system which leverages the Mailgun API to generate a list of emails which failed to send, providing our client and the admin team with actionable information regarding their communication endeavours with customers.",
  "12": "Wrote a script to facilitate the detection of broken links in hundreds of blog articles, avoiding many hours of manual checking.",
  "13": "Identified and fixed a major stored XSS vulnerability which could have resulted in unauthorized access to administrator accounts.",
  "14": "Took full ownership of the design and implementation of a system allowing to export an Excel file showing a report of users with abandoned orders for products, allowing the admin team to take action to improve conversions.",
  "15": "Fixed npm dependency issue affecting admin-facing tools. This involved updating a faulty package and doing the necessary updates in the code to match the new version's syntax and usage.",
  "16": "Implemented a system which allowed to automatically redirect specific groups of URLs containing uppercase letters to their fully-lowercase versions. This was challenging because the determining factor in whether or not a given URL had to be redirected was whether its route name, not the URL itself, contained a specific string. Thus, we had to add a catch-all route with a middleware and have the middleware compute the route name for the all-lowercase equivalent of the accessed URL, and then redirect the URL if its route matched the criteria.",
  "17": "Wrote many customizations for <a href='https://quilljs.com/' target='_blank' rel='noopener noreferrer'>Quill.js</a> to give the client's team more flexibility in the content of the blog posts they create. Namely, we built, from scratch, support for adding CTA buttons, a references table, rich images with a caption and an alt tag, custom product advertisements, tables, and collapsible animated content. This involved writing and maintaining a lot of custom JavaScript to interact with Quill's API extensively.",
  "18": "Currently building and maintaining a CI/CD pipeline allowing to automatically test and lint code before any PR gets merged. Implemented caching of node dependencies to reduce CI/CD compute time, resulting in faster status reports and monthly savings on the GitHub Actions bill for our client.",
  "19": "Currently building many full-stack features (167 pull requests merged to date).",
  "20": "Fixed many issues occurring with complex Eloquent queries. As the client's requests for data filtering functionality increased in complexity, so did the sophistication of the queries we had to write in order to support the desired filtering. As a result, the client would often encounter issues where the data returned didn't match the filters they set. We were consistently able to successfully fix the queries, resulting in reliably-correct data-filtering results.",
  "21": "Communicated directly with our client's client to get a thorough understanding of their desired requirements on many complex features, such as user &quot;flagging&quot; logic, sending text messages to users based on very specific conditions and actions taken by users and admins, or grouping different user orders' repeat dates in the system for efficiency of processing. Then, we took ownership of the design and implementation of the solution. This type of task is where our team's capabilities are most valuable to our client, as our combination of excellent communication skills and deep technical expertise allow us to collaborate with the client's client in almost complete autonomy, alleviating the rest of the team's workload.",
  "22": "Improved internal documentation as we onboarded onto the client's codebase to help future developers get set up faster. This is particularly relevant in our client's context as its team is fully remote and only comprises independent contractors who are expected to be able to set up their local stack in near full autonomy.",
  "23": "Added support for the upload of HEIC images by customers. Since the libraries we used didn't support this out of the box, we had to convert the images to JPG before storing them.",
  "24": "Secured Cloud Firestore database by writing security rules. This was quite challenging because the Proximy app stores a lot of personal data which must be protected, but also involves a lot of interaction between users. As a result, we had to write rules that were both secure, but also allowed for users involved in specific interactions to access and update the data relevant to those interaction.",
  "25": "Built many customer-facing, cross-platform mobile app features on Proximy's mobile app. For instance, we built the \"add as a friend\" feature. This was technically challenging because, in order to ensure the feature worked robustly, we had to handle the case where both users clicked on the \"add as a friend\" button at the same time, which would have resulted in the creation of two separate friend requests, which would have been a forbidden state. To solve this, we utilized Cloud Firestore transactions to ensure that when we handled friend requests, we did so in a way which always resulted in a valid state. In this case, for instance, the two users would become friends. Our client appreciated our attention to detail and concern with quality."
}
